/*!------------------------------------------------
@file       Hoge.h
@brief      
@attention  なし
--------------------------------------------------*/
#include <unistd.h>
#include "Hoge.h"

/*!------------------------------------------------
@brief      デフォルトコンストラクタ
@note       クラスを構築する
@attention  なし
--------------------------------------------------*/
Hoge::Hoge() {
  setObject(this);
}

/*!------------------------------------------------
@brief      デフォルトデストラクタ
@note       クラスを破棄する
@attention  なし
--------------------------------------------------*/
Hoge::~Hoge() {
}

/*!------------------------------------------------
@brief      
@note       
@param[in]  パラメータ名  説明  [単位] (範囲)
@param[out] 
@return     なし
@attention  なし
--------------------------------------------------*/
void Hoge::exec() {
  while(1) {
    std::cout << "hoge" << std::endl;
    sleep(1);
  }
}

